tap "argon/mas"
tap "rcmdnk/file"
brew "ansible"
brew "libpng"
brew "autoconf"
brew "automake"
brew "aws-sam-cli"
brew "awscli"
brew "freetype"
brew "curl"
brew "libzip"
brew "direnv"
brew "docker"
brew "gemini-cli"
brew "libiconv"
brew "git"
brew "glab"
brew "icu4c@77"
brew "gzip"
brew "jpeg"
brew "jq"
brew "libxml2"
brew "mas"
brew "zlib"
brew "mysql-client"
brew "nkf"
brew "nodebrew"
brew "pandoc"
brew "php@8.3"
brew "composer"
brew "putty"
brew "pwgen"
brew "pyenv"
brew "rbenv"
brew "re2c"
brew "smartmontools"
brew "tfenv"
brew "tflint"
brew "tmux"
brew "unar"
brew "uv"
brew "vim"
brew "wget"
brew "wp-cli"
brew "zsh-autosuggestions"
brew "zsh-git-prompt"
brew "zsh-syntax-highlighting"
brew "rcmdnk/file/brew-file"
cask "antigravity"
cask "clipy"
cask "coderabbit"
cask "codex"
cask "cursor"
cask "cursor-cli"
cask "docker-desktop"
cask "firefox"
cask "google-chrome", args: { appdir: "/Applications" }
cask "iterm2", args: { appdir: "/Applications" }
cask "karabiner-elements", args: { appdir: "/Applications" }
cask "kiro"
cask "slack", args: { appdir: "/Applications" }
cask "the-unarchiver", args: { appdir: "/Applications" }
cask "vagrant"
cask "virtualbox"
cask "visual-studio-code", args: { appdir: "/Applications" }
cask "zap"
cask "zoom"
mas "Commander One", id: 1035236694
mas "GarageBand", id: 682658836
mas "iMovie", id: 408981434
mas "Keynote", id: 409183694
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Windows App", id: 1295203466
vscode "42crunch.vscode-openapi"
vscode "amazonwebservices.aws-toolkit-vscode"
vscode "arjun.swagger-viewer"
vscode "bierner.markdown-mermaid"
vscode "gitlab.gitlab-workflow"
vscode "hashicorp.terraform"
vscode "hediet.vscode-drawio"
vscode "marp-team.marp-vscode"
vscode "ms-azuretools.vscode-containers"
vscode "ms-vscode-remote.remote-containers"
vscode "redhat.vscode-yaml"
vscode "tomoki1207.pdf"
